In [50]:
import pandas as pd
import numpy as np
import os
import re
from dateutil.relativedelta import relativedelta
from statsmodels.tsa import seasonal
from matplotlib import pyplot as plt
from functools import reduce  # Operação de reduce para cálculo de média de uma lista
from datetime import datetime
%matplotlib inline

# Setting values

In [51]:
df=pd.DataFrame(index=['A','B','C'], columns=['x','y'])
df

     x    y
A  NaN  NaN
B  NaN  NaN
C  NaN  NaN

In [52]:
df.set_value('A','x',10)

     x    y
A   10  NaN
B  NaN  NaN
C  NaN  NaN

# Creating dataframe with indexes and column names

In [53]:
test_df = pd.DataFrame(index=range(1973,2018,1), columns=['c1','c2','c3'])
test_df.head()

       c1   c2   c3
1973  NaN  NaN  NaN
1974  NaN  NaN  NaN
1975  NaN  NaN  NaN
1976  NaN  NaN  NaN
1977  NaN  NaN  NaN

In [54]:
test_df.set_value(1973,'c1', 89.13)
test_df.set_value(1974,'c2', 819.52)
test_df.set_value(1975,'c3', 14.35)
test_df.head(5)

         c1      c2     c3
1973  89.13     NaN    NaN
1974    NaN  819.52    NaN
1975    NaN     NaN  14.35
1976    NaN     NaN    NaN
1977    NaN     NaN    NaN

## Merge columsn from different dataframes with same index

In [55]:
a_df=pd.DataFrame(index=['A','B','C'], columns=['x','y'])
b_df=pd.DataFrame(index=['A','B','C'], columns=['x','y'])

a_df.set_value('A','x', 1)
a_df.set_value('B','x', 2)
a_df.set_value('C','x', 3)
a_df.set_value('A','y', 4)
a_df.set_value('B','y', 5)
a_df.set_value('C','y', 6)

b_df.set_value('A','x', 7)
b_df.set_value('B','x', 8)
b_df.set_value('C','x', 9)
b_df.set_value('A','y', 10)
b_df.set_value('B','y', 11)
b_df.set_value('C','y', 12)

   x   y
A  7  10
B  8  11
C  9  12

In [56]:
a_df

   x  y
A  1  4
B  2  5
C  3  6

In [57]:
b_df

   x   y
A  7  10
B  8  11
C  9  12

In [61]:

list_b_x = list(b_df['x'])
a_df.loc[:,'z'] = pd.Series(list_b_x, index=a_df.index)